---
title: 全球宕机事件中的教训：为何Rust语言是未来的选择？
date: 2023-07-21 14:41:00
categories: [rust]
tags: []
pin: false
---

### 引言

7月19日，微软及其关联公司的全球大范围宕机事件震惊了整个技术界。从美洲到欧洲、亚洲，几乎所有行业的企业和用户都受到了影响。这次事件导致了航空铁路停运、媒体直播中断、银行系统异常等一系列问题。故障的根源被追溯到CrowdStrike的一次更新，导致了Windows系统的大量蓝屏死机。

### 事件回顾

据报道，问题的源头是一家全球网络安全公司CrowdStrike的一次错误的更新。这次更新导致安装了CrowdStrike安全软件“Falcon”的电脑出现蓝屏，无法正常运行。

多国受到影响，包括美国、英国、澳大利亚、日本等国家的航空、铁路、金融、医疗、媒体等多个行业都因此陷入混乱。即便微软和CrowdStrike迅速采取措施，全球范围内的影响依然难以在短时间内完全消除。

### 为什么Rust语言可以避免这种情况？

Rust语言以其内存安全性和并发性而闻名，能够在编译时避免许多常见的编程错误，如空指针引用和越界访问。这些问题正是此次全球宕机事件的主要原因。

1. **内存安全性**：Rust的所有权系统和借用检查器确保了在编译时捕获内存管理错误。像空指针引用和缓冲区溢出等问题在Rust中几乎不可能发生。
   
2. **并发性**：Rust为并发编程提供了强大的工具，能够确保在多线程环境中安全地共享数据。这在处理大型分布式系统时尤为重要。

3. **高性能**：Rust的性能与C和C++相当，但没有它们的内存管理问题。这使得Rust成为开发高性能系统的理想选择。

### 哪些大项目在使用Rust？

越来越多的知名项目开始采用Rust语言进行开发，这进一步证明了Rust在现代软件开发中的重要性，下面举例一些正在使用并投入生产的相关项目。

- **Mozilla Firefox**：Rust的开发者Mozilla在Firefox浏览器中使用Rust来重写其核心组件，提高了安全性和性能。
- **Dropbox**：这家知名的云存储服务公司在其后端系统中使用了Rust，确保了数据的安全和系统的高效运行。
- **Amazon Web Services (AWS) **：AWS使用Rust来构建关键的云服务组件，提升了服务的可靠性和性能。

在国内：

- **OpenHarmony（开源鸿蒙）**：由华为主导的开源鸿蒙中，截止本文撰写时间，Rust代码已占15%的比例，并且Rust代码在不断增加，也将在鸿蒙操作系统扮演重要作用。
- **BlusOS（蓝河操作系统）**：蓝河操作系统是Vivo面向通用人工智能时代自主研发的智慧操作系统。基于高安全、高性能的 Rust 语言开发系统框架，Rust 一系列的安全技术特性，保障了内存安全和并发安全。

### 结语

此次微软全球宕机事件给我们敲响了警钟，提醒我们在软件开发中安全机制的至关重要。

从我开发作为开发者，我也始终记住一句话：一个合格的程序开发过程，首先要考虑的是安全，其次是稳健，最后才是功能。

而Rust凭借其内存安全性和高性能，能够有效避免许多常见的编程错误，在未来，Rust有望成为更多大型项目的首选编程语言，助力开发者构建更加可靠和高效的系统。

---

欢迎关注，后续带来更多互联网与前沿技术相关的分享！


如果你对Rust语言的入门学习感兴趣，还可以参考我花半年以上时间整理的学习笔记：
《rust中文wiki》<github.com/webtechwiki/rust>
